RT-Thread-packages/gd32-arm-cmsis/GD32H77x_78x/GD/GD32H77x_78x/Include/gd32h77x_78x.h
/*!
    \file    gd32h77x_78x.h
    \brief   general definitions for gd32h77x_78x
    
    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
 * Copyright (c) 2009-2021 Arm Limited. All rights reserved.
 * Copyright (c) 2026, GigaDevice Semiconductor Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* This file refers the CMSIS standard, some adjustments are made according to GigaDevice chips */

#ifndef GD32H77X_78X_H
#define GD32H77X_78X_H

#ifdef __cplusplus
 extern "C" {
#endif 

/* GD32H77X_78X NVMC types */
#if defined(GD32H77EXW) || defined(GD32H77DXW) || defined(GD32H779XW) || \
    defined(GD32H78EXW) || defined(GD32H78DXW) || defined(GD32H789XW)
    #define GD32H77X_78X_XW
#elif defined(GD32H77EXP) || defined(GD32H77DXP) || defined(GD32H779XP) || \
      defined(GD32H78EXP) || defined(GD32H78DXP) || defined(GD32H789XP) || \
      defined(GD32H78RXP) || defined(GD32H77RXP)
    #define GD32H77X_78X_XP
#elif defined(GD32H77EXI) || defined(GD32H77DXI) || defined(GD32H779XI) || \
      defined(GD32H78EXI) || defined(GD32H78DXI) || defined(GD32H789XI)
    #define GD32H77X_78X_XI
#endif

/* GD32H77X_78X with ESC module */
#if defined(GD32H77EXW) || defined(GD32H77EXP) || defined(GD32H77EXI) || \
    defined(GD32H78EXW) || defined(GD32H78EXP) || defined(GD32H78EXI) || \
    defined(GD32H78RXP) || defined(GD32H77RXP)
    #define GD32H77X_78X_SUPPORT_ESC
#endif

/* GD32H77X_78X with DSI module */
#if defined(GD32H77DXW) || defined(GD32H77DXP) || defined(GD32H77DXI) || \
    defined(GD32H78DXW) || defined(GD32H78DXP) || defined(GD32H78DXI)
    #define GD32H77X_78X_SUPPORT_DSI
#endif

/* GD32H78X support 700MHz or 750MHz */
#if defined(GD32H78EXW) || defined(GD32H78EXP) || defined(GD32H78EXI) || \
    defined(GD32H78DXW) || defined(GD32H78DXP) || defined(GD32H78DXI) || \
    defined(GD32H789XW) || defined(GD32H789XP) || defined(GD32H789XI) || \
    defined(GD32H78RXP)
#if defined(GD32H78X_HIGH_PERFORMANCE_MODE)
    #define GD32H78X_SUPPORT_MAX_750M
#else
    #define GD32H78X_SUPPORT_MAX_700M
#endif
#endif

#if !defined (GD32H77EXW) && !defined (GD32H77DXW) && !defined (GD32H779XW) && \
    !defined (GD32H77EXP) && !defined (GD32H77DXP) && !defined (GD32H779XP) && \
    !defined (GD32H77EXI) && !defined (GD32H77DXI) && !defined (GD32H779XI) && \
    !defined (GD32H78EXW) && !defined (GD32H78DXW) && !defined (GD32H789XW) && \
    !defined (GD32H78EXP) && !defined (GD32H78DXP) && !defined (GD32H789XP) && \
    !defined (GD32H78EXI) && !defined (GD32H78DXI) && !defined (GD32H789XI) && \
    !defined (GD32H78RXP) && !defined(GD32H77RXP)
#error "Please select the target gd32h77x_78x device used in your application (in gd32h77x_78x.h file)"
#endif /* undefine GD32H77X_78X tip */

/* define value of high speed crystal oscillator (HXTAL) in Hz */
#if !defined  (HXTAL_VALUE)
#define HXTAL_VALUE    ((uint32_t)25000000)
#endif /* high speed crystal oscillator value */

/* define startup timeout value of high speed crystal oscillator (HXTAL) */
#if !defined  (HXTAL_STARTUP_TIMEOUT)
#define HXTAL_STARTUP_TIMEOUT   ((uint16_t)0x0FFFF)
#endif /* high speed crystal oscillator startup timeout */

/* define value of internal 64MHz RC oscillator (IRC64M) in Hz */
#if !defined  (IRC64M_VALUE) 
#define IRC64M_VALUE  ((uint32_t)64000000)
#endif /* internal 64MHz RC oscillator value */

/* define startup timeout value of internal 64MHz RC oscillator (IRC64M) */
#if !defined  (IRC64M_STARTUP_TIMEOUT)
#define IRC64M_STARTUP_TIMEOUT   ((uint32_t)0x0FFFFFFF)
#endif /* internal 64MHz RC oscillator startup timeout */

/* define value of Low Power Internal 4Mhz RC oscillator (LPIRC4M) in Hz */
#if !defined  (LPIRC4M_VALUE) 
#define LPIRC4M_VALUE  ((uint32_t)4000000)
#endif /* Low Power Internal 4Mhz RC oscillator value */

/* define startup timeout value of internal Low Power Internal 4Mhz RC oscillator (LPIRC4M) */
#if !defined  (LPIRC4M_STARTUP_TIMEOUT)
#define LPIRC4M_STARTUP_TIMEOUT   ((uint16_t)0x0500)
#endif /* Low Power Internal 4Mhz RC oscillator startup timeout */

/* define value of internal 48MHz RC oscillator (IRC48M) in Hz */
#if !defined  (IRC48M_VALUE) 
#define IRC48M_VALUE ((uint32_t)48000000)
#endif /* internal 48MHz RC oscillator value */

/* define startup timeout value of internal 48MHz RC oscillator (IRC48M) */
#if !defined  (IRC48M_STARTUP_TIMEOUT)
#define IRC48M_STARTUP_TIMEOUT   ((uint16_t)0x0500)
#endif /* internal 48MHz RC oscillator startup timeout */

/* define value of internal 32KHz RC oscillator(IRC32K) in Hz */
#if !defined  (IRC32K_VALUE) 
#define IRC32K_VALUE  ((uint32_t)32000)
#endif /* internal 32KHz RC oscillator value */

/* define startup timeout value of internal 32KHz RC oscillator (IRC32K) */
#if !defined  (IRC32K_STARTUP_TIMEOUT)
#define IRC32K_STARTUP_TIMEOUT   ((uint16_t)0x0500)
#endif /* internal 32KHz RC oscillator startup timeout */

/* define value of low speed crystal oscillator (LXTAL)in Hz */
#if !defined  (LXTAL_VALUE) 
#define LXTAL_VALUE  ((uint32_t)32768)
#endif /* low speed crystal oscillator value */

/* define startup timeout value of low speed crystal oscillator (LXTAL) */
#if !defined  (LXTAL_STARTUP_TIMEOUT)
#define LXTAL_STARTUP_TIMEOUT   ((uint32_t)0x0FFFFFFF)
#endif /* low speed crystal oscillator startup timeout */

/* GD32H77X_78X firmware library version number V0.5.0 */
#define __GD32H77X_78X_STDPERIPH_VERSION_MAIN   (0x00) /*!< [31:24] main version     */
#define __GD32H77X_78X_STDPERIPH_VERSION_SUB1   (0x05) /*!< [23:16] sub1 version     */
#define __GD32H77X_78X_STDPERIPH_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version     */
#define __GD32H77X_78X_STDPERIPH_VERSION_RC     (0x00) /*!< [7:0]  release candidate */ 
#define __GD32H77X_78X_STDPERIPH_VERSION        ((__GD32H77X_78X_STDPERIPH_VERSION_MAIN << 24)\
                                            |(__GD32H77X_78X_STDPERIPH_VERSION_SUB1 << 16)\
                                            |(__GD32H77X_78X_STDPERIPH_VERSION_SUB2 << 8)\
                                            |(__GD32H77X_78X_STDPERIPH_VERSION_RC))

/* configuration of the Cortex-M7 processor and core peripherals                             */
#define __CM7_REV               0x0102U   /*!< Cortex-M7 revision r1p2                       */
#define __MPU_PRESENT             1       /*!< CM7 provides an MPU                           */
#define __NVIC_PRIO_BITS          4       /*!< CM7 uses 4 Bits for the Priority Levels       */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used  */
#define __FPU_PRESENT             1       /*!< FPU present                                   */
#define __ICACHE_PRESENT          1       /*!< CM7 instruction cache present                 */
#define __DCACHE_PRESENT          1       /*!< CM7 data cache present                        */

