RT-Thread-packages/gd32-arm-cmsis/GD32H77x_78x/GD/GD32H77x_78x/Include/gd32h77x_78x.h
    TIMER2_DEC_IRQn                 = 210,    /*!< TIMER2 DEC interrupt                                                                 */
    TIMER3_DEC_IRQn                 = 211,    /*!< TIMER3 DEC interrupt                                                                 */
    TIMER4_DEC_IRQn                 = 212,    /*!< TIMER4 DEC interrupt                                                                 */
    TIMER22_DEC_IRQn                = 213,    /*!< TIMER22 DEC interrupt                                                                */
    TIMER23_DEC_IRQn                = 214,    /*!< TIMER23 DEC interrupt                                                                */
    TIMER30_DEC_IRQn                = 215,    /*!< TIMER30 DEC interrupt                                                                */
    TIMER31_DEC_IRQn                = 216,    /*!< TIMER31 DEC interrupt                                                                */
    CPU_DCACHE_ERR_IRQn             = 217,    /*!< CPU D-Cache error detection interrupt                                                */
    CPU_ICACHE_ERR_IRQn             = 218,    /*!< CPU I-Cache error detection interrupt                                                */
    VOVD_VUVD_FILTER_IRQn           = 219,    /*!< VOVD / VUVD interrupt after digital filtering interrupt                                 */
    TIMER0_Channel_BRK_IRQn         = 221,    /*!< TIMER0 channel break interrupt                                                       */
    TIMER7_Channel_BRK_IRQn         = 222,    /*!< TIMER7 channel break interrupt                                                       */
    DSI_IRQn                        = 223,    /*!< DSI global interrupt                                                                 */
    PKCAU_IRQn                      = 224,    /*!< PKCAU global interrupt                                                               */
    ESC_BRIDGE_IRQn                 = 225,    /*!< ESC internal interrupt                                                               */
    EDIM_IRQn                       = 226     /*!< EDIM global interrupt                                                                */
} IRQn_Type;

/* includes */
#include "core_cm7.h"
#include "system_gd32h77x_78x.h"
#include <stdint.h>
#ifdef FW_DEBUG_ERR_REPORT
#include "gd32h77x_78x_err_report.h"
#endif /* FW_DEBUG_ERR_REPORT */

/* enum definitions */
typedef enum {DISABLE = 0, ENABLE = !DISABLE} EventStatus, ControlStatus;
typedef enum {RESET = 0, SET = !RESET} FlagStatus;
typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrStatus;

/* bit operations */
#define REG64(addr)                  (*(volatile uint64_t *)(uint32_t)(addr))
#define REG32(addr)                  (*(volatile uint32_t *)(uint32_t)(addr))
#define REG16(addr)                  (*(volatile uint16_t *)(uint32_t)(addr))
#define REG8(addr)                   (*(volatile uint8_t *)(uint32_t)(addr))
#define BIT(x)                       ((uint32_t)((uint32_t)0x01U << (x)))
#define BITS(start, end)             ((0xFFFFFFFFUL << (start)) & (0xFFFFFFFFUL >> (31U - (uint32_t)(end)))) 
#define GET_BITS(regval, start, end) (((regval) & BITS((start),(end))) >> (start))

/* main CNVM and SRAM memory map */
#define CNVM_BASE             ((uint32_t)0x08010000U)       /*!< CNVM base address                */
#define SRAM_BASE             ((uint32_t)0x24000000U)       /*!< SRAM base address                */

/* peripheral memory map */
#define APB1_BUS_BASE         ((uint32_t)0x40000000U)       /*!< APB1 base address                */
#define APB2_BUS_BASE         ((uint32_t)0x40010000U)       /*!< APB2 base address                */
#define APB3_BUS_BASE         ((uint32_t)0x50000000U)       /*!< APB3 base address                */
#define APB4_BUS_BASE         ((uint32_t)0x58000000U)       /*!< APB4 base address                */
#define AHB1_BUS_BASE         ((uint32_t)0x40020000U)       /*!< AHB1 base address                */
#define AHB2_BUS_BASE         ((uint32_t)0x48000000U)       /*!< AHB2 base address                */
#define AHB3_BUS_BASE         ((uint32_t)0x51000000U)       /*!< AHB3 base address                */
#define AHB4_BUS_BASE         ((uint32_t)0x58010000U)       /*!< AHB4 base address                */

/* advanced peripheral bus 1 memory map */
#define TIMER_BASE            (APB1_BUS_BASE + 0x00000000U) /*!< TIMER base address               */
#define SPI_BASE              (APB1_BUS_BASE + 0x00003800U) /*!< SPI base address                 */
#define RSPDIF_BASE           (APB1_BUS_BASE + 0x00004000U) /*!< RSPDIF base address              */
#define USART_BASE            (APB1_BUS_BASE + 0x00004400U) /*!< USART base address               */
#define I2C_BASE              (APB1_BUS_BASE + 0x00005400U) /*!< I2C base address                 */
#define DAC_BASE              (APB1_BUS_BASE + 0x00007400U) /*!< DAC base address                 */
#define CTC_BASE              (APB1_BUS_BASE + 0x00008400U) /*!< CTC base address                 */
#define MDIO_BASE             (APB1_BUS_BASE + 0x00009400U) /*!< MDIO base address                */
#define EDIM_BASE             (APB1_BUS_BASE + 0x0000C400U) /*!< EDIM base address                */

/* advanced peripheral bus 2 memory map */
#define ADC_BASE              (APB2_BUS_BASE + 0x00002400U) /*!< ADC base address                 */
#define SAI_BASE              (APB2_BUS_BASE + 0x00005800U) /*!< SAI base address                 */
#define RDCM_BASE             (APB2_BUS_BASE + 0x00006400U) /*!< RDCM base address                */
#define HPDF_BASE             (APB2_BUS_BASE + 0x00007000U) /*!< HPDF base address                */
#define TRIGSEL_BASE          (APB2_BUS_BASE + 0x00008400U) /*!< TRIGSEL base address             */
#define EDOUT_BASE            (APB2_BUS_BASE + 0x00008800U) /*!< EDOUT base address               */
#define CAN_BASE              (APB2_BUS_BASE + 0x0000A000U) /*!< CAN base address                 */

/* advanced peripheral bus 3 memory map */
#define TLI_BASE              (APB3_BUS_BASE + 0x00001000U) /*!< TLI base address                 */
#define WWDGT_BASE            (APB3_BUS_BASE + 0x00003000U) /*!< WWDGT base address               */

/* advanced peripheral bus 4 memory map */
#define EXTI_BASE             (APB4_BUS_BASE + 0x00000000U) /*!< EXTI base address                */
#define SYSCFG_BASE           (APB4_BUS_BASE + 0x00000400U) /*!< SYSCFG base address              */
#define CMP_BASE              (APB4_BUS_BASE + 0x00003800U) /*!< CMP base address                 */
#define VREF_BASE             (APB4_BUS_BASE + 0x00003C00U) /*!< VREF base address                */
#define RTC_BASE              (APB4_BUS_BASE + 0x00004000U) /*!< RTC base address                 */
#define FWDGT_BASE            (APB4_BUS_BASE + 0x00004800U) /*!< FWDGT base address               */
#define PMU_BASE              (APB4_BUS_BASE + 0x00005800U) /*!< PMU base address                 */
#define LPDTS_BASE            (APB4_BUS_BASE + 0x00006800U) /*!< LPDTS base address               */

/* advanced high performance bus 1 memory map */
#define DMA_BASE              (AHB1_BUS_BASE + 0x00000000U) /*!< DMA base address                 */
#define DMAMUX_BASE           (AHB1_BUS_BASE + 0x00000800U) /*!< DMAMUX base address              */
#define ENET_BASE             (AHB1_BUS_BASE + 0x00008000U) /*!< ENET base address                */
#define USBHS_BASE            (AHB1_BUS_BASE + 0x00020000U) /*!< USBHS base address               */

/* advanced high performance bus 2 memory map */
#define PKCAU_BASE            (AHB2_BUS_BASE + 0x00000000U) /*!< PKCAU base address               */
#define DCI_BASE              (AHB2_BUS_BASE + 0x00020000U) /*!< DCI base address                 */
#define GPSI_BASE             (AHB2_BUS_BASE + 0x00020200U) /*!< GPSI base address                */
#define CAU_BASE              (AHB2_BUS_BASE + 0x00021000U) /*!< CAU base address                 */
#define HAU_BASE              (AHB2_BUS_BASE + 0x00021400U) /*!< HAU base address                 */
#define TRNG_BASE             (AHB2_BUS_BASE + 0x00021800U) /*!< TRNG base address                */
#define SDIO_BASE             (AHB2_BUS_BASE + 0x00022400U) /*!< SDIO base address                */
#define CPDM_BASE             (AHB2_BUS_BASE + 0x00022800U) /*!< CPDM base address                */
#define RAMECCMU_BASE         (AHB2_BUS_BASE + 0x00023000U) /*!< RAMECCMU base address            */
#define FFT_BASE              (AHB2_BUS_BASE + 0x00024000U) /*!< FFT base address                 */
#define TMU_BASE              (AHB2_BUS_BASE + 0x00024400U) /*!< TMU base address                 */
#define FAC_BASE              (AHB2_BUS_BASE + 0x00024800U) /*!< FAC base address                 */

/* advanced high performance bus 3 memory map */
#define AXIM_BASE             (AHB3_BUS_BASE + 0x00000000U) /*!< AXIM base address                */
#define MDMA_BASE             (AHB3_BUS_BASE + 0x01000000U) /*!< MDMA base address                */
#define IPA_BASE              (AHB3_BUS_BASE + 0x01001000U) /*!< IPA base address                 */
#define NVMC_BASE             (AHB3_BUS_BASE + 0x01002000U) /*!< NVMC base address                */
#define DSI_BASE              (AHB3_BUS_BASE + 0x01003000U) /*!< MIPI DSI base address            */
#define EXMC_BASE             (AHB3_BUS_BASE + 0x01004000U) /*!< EXMC base address                */
#define OSPI_BASE             (AHB3_BUS_BASE + 0x01005000U) /*!< OSPI base address                */
#define OSPM_BASE             (AHB3_BUS_BASE + 0x0100B400U) /*!< OSPM base address                */
#define RTDEC_BASE            (AHB3_BUS_BASE + 0x0100B800U) /*!< RTDEC base address               */

/* advanced high performance bus 4 memory map */
#define GPIO_BASE             (AHB4_BUS_BASE + 0x00010000U) /*!< GPIO base address                */
#define RCU_BASE              (AHB4_BUS_BASE + 0x00014400U) /*!< RCU base address                 */
#define CRC_BASE              (AHB4_BUS_BASE + 0x00014C00U) /*!< CRC base address                 */
#define HWSEM_BASE            (AHB4_BUS_BASE + 0x00016400U) /*!< HWSEM base address               */
#define ESC_BASE              (0x5F000000U)                 /*!< ESC base address                 */

/* option byte and debug memory map */
#define OB_BASE               ((uint32_t)0x1FFFF800U)       /*!< OB base address                  */
#define DBG_BASE              ((uint32_t)0xE00E1000U)       /*!< DBG base address                 */

/* define marco USE_STDPERIPH_DRIVER */
#if !defined  USE_STDPERIPH_DRIVER
#define USE_STDPERIPH_DRIVER
#endif
#ifdef USE_STDPERIPH_DRIVER
#include "gd32h77x_78x_libopt.h"
#endif /* USE_STDPERIPH_DRIVER */

#ifdef __cplusplus
}
#endif

#endif /* GD32H77X_78X_H */
